import React from "react";
import { BiChevronRight } from "react-icons/bi";
// import Showcase from "../assets/images/home/slider/2.png";

const About = () => {
    return (
        <div className="wrapper">
            <div className="block pt-6">
                <p className="opacity-50 inline-block  lowercase">მთავარი</p>
                <BiChevronRight className="inline-block mx-1" />
                <p className="  inline-block lowercase">ჩვენ შესახებ</p>
            </div>
            <div className="sm:h-80 h-40 w-full my-8 bg-gradient-to-b from-custom-blue-900/[0.5] to-transparent">
                <img
                    src="/assets/images/home/slider/2.png"
                    alt=""
                    className="w-full h-full object-cover relative -z-10"
                />
            </div>
            <div className="lowercase mb-5">აღმშენებლობა სმბ მეტალო ბაზა</div>
            <div className="lg:text-5xl  text-xl">
                რაიმე სლოგანი კომპანიის <br /> საქმიანობის შესახებ
            </div>
            <p className="md:columns-2 gap-16 text-justify md:mt-10 mt-5 mb-20 lowercase text-sm md:text-base">
                შემთხვევითად გენერირებული ტექსტი ეხმარება დიზაინერებს და ტიპოგრაფიული
                ნაწარმის შემქმნელებს, რეალურთან მაქსიმალურად მიახლოებული შაბლონი
                წარუდგინონ შემფასებელს. ხშირადაა შემთხვევა, როდესაც დიზაინის
                შესრულებისას საჩვენებელია, თუ როგორი იქნება ტექსტის ბლოკი. სწორედ ასეთ
                დროს არის მოსახერხებელი ამ გენერატორით შექმნილი ტექსტის გამოყენება,
                რადგან უბრალოდ „ტექსტი ტექსტი ტექსტი“ ან სხვა გამეორებადი სიტყვების
                ჩაყრა, ხელოვნურ ვიზუალურ სიმეტრიას ქმნის და არაბუნებრივად გამოიყურება
                შემთხვევითად გენერირებული ტექსტი ეხმარება დიზაინერებს და ტიპოგრაფიული
                ნაწარმის შემქმნელებს, რეალურთან მაქსიმალურად მიახლოებული შაბლონი
                წარუდგინონ შემფასებელს. ხშირადაა შემთხვევა, როდესაც დიზაინის
                შესრულებისას საჩვენებელია, თუ როგორი იქნება ტექსტის ბლოკი. სწორედ ასეთ
                დროს არის მოსახერხებელი ამ გენერატორით შექმნილი ტექსტის გამოყენება,
                რადგან უბრალოდ „ტექსტი ტექსტი ტექსტი“ ან სხვა გამეორებადი სიტყვების დროს
                არის მოსახერხებელი ამ გენერატორით შექმნილი ტექსტის გამოყენება, რადგან
                უბრალოდ „ტექსტი ტექსტი ტექსტი“ ან სხვა გამეორებადი სიტყვების ჩაყრა,
                ხელოვნურ ვიზუალურ სიმეტრიას ქმნის და არაბუნებრივად გამოიყურება
                შემთხვევითად გენერირებული ტექსტი ეხმარება დიზაინერებს და ტიპოგრაფიული
                ნაწარმის შემქმნელებს, რეალურთან მაქსიმალურად მიახლოებული შაბლონი
                წარუდგინონ შემფასებელს. ხშირადაა შემთხვევა, როდესაც დიზაინის
                შესრულებისას საჩვენებელია, თუ როგორი იქნება ტექსტის ბლოკი. სწორედ ასეთ
                დროს არის მოსახერხებელი ამ გენერატორით შექმნილი ტექსტის გამოყენება,
                რადგან უბრალოდ „ტექსტი ტექსტი ტექსტი“ ან სხვა გამეორებადი სიტყვების დროს
                არის მოსახერხებელი ამ გენერატორით შექმნილი ტექსტის გამოყენება, რადგან
                უბრალოდ „ტექსტი ტექსტი ტექსტი“ ან სხვა გამეორებადი სიტყვების ჩაყრა,
                ხელოვნურ ვიზუალურ სიმეტრიას ქმნის და არაბუნებრივად გამოიყურება
                შემთხვევითად გენერირებული ტექსტი ეხმარება დიზაინერებს და ტიპოგრაფიული
                ნაწარმის შემქმნელებს, რეალურთან მაქსიმალურად მიახლოებული შაბლონი
                წარუდგინონ შემფასებელს. ხშირადაა შემთხვევა, როდესაც დიზაინის
                შესრულებისას საჩვენებელია, თუ როგორი იქნება ტექსტის ბლოკი. სწორედ ასეთ
                დროს არის მოსახერხებელი ამ გენერატორით შექმნილი ტექსტის გამოყენება,
                რადგან უბრალოდ „ტექსტი ტექსტი ტექსტი“ ან სხვა გამეორებადი სიტყვების დროს
                არის მოსახერხებელი ამ გენერატორით შექმნილი ტექსტის გამოყენება, რადგან
                უბრალოდ „ტექსტი ტექსტი ტექსტი“ ან სხვა გამეორებადი სიტყვების ჩაყრა,
                ხელოვნურ ვიზუალურ სიმეტრიას ქმნის და არაბუნებრივად გამოიყურება
                შემთხვევითად გენერირებული ტექსტი ეხმარება დიზაინერებს და ტიპოგრაფიული
                ნაწარმის შემქმნელებს, რეალურთან მაქსიმალურად მიახლოებული შაბლონი
                წარუდგინონ შემფასებელს. ხშირადაა შემთხვევა, როდესაც დიზაინის
                შესრულებისას საჩვენებელია, თუ როგორი იქნება ტექსტის ბლოკი. სწორედ ასეთ
                დროს არის მოსახერხებელი ამ გენერატორით შექმნილი ტექსტის გამოყენება,
                რადგან უბრალოდ „ტექსტი ტექსტი ტექსტი“ ან სხვა გამეორებადი სიტყვების
                ჩაყრა, ხელოვნურ ვიზუალურ სიმეტრიას ქმნის და არაბუნებრივად გამოიყურება
            </p>
        </div>
    );
};

export default About;
